In [1]:
import pandas as pd

In [2]:
dataset={"Name" :["Ahmar","Tayyab","Nokhaiz","Awais"],"Age":[23,12,12,13],"Salary":[23000,45000,55000,23000]}
df =pd.DataFrame(dataset)
print(df)

      Name  Age  Salary
0    Ahmar   23   23000
1   Tayyab   12   45000
2  Nokhaiz   12   55000
3    Awais   13   23000

In [3]:
s =pd.Series([1,2,3,4,5],index =['a','b','c','d','f'])
print(s)

a    1
b    2
c    3
d    4
f    5
dtype: int64

In [4]:
df["Name"]

0      Ahmar
1     Tayyab
2    Nokhaiz
3      Awais
Name: Name, dtype: object

In [5]:
df[["Name","Age"]]

      Name  Age
0    Ahmar   23
1   Tayyab   12
2  Nokhaiz   12
3    Awais   13

In [6]:
df.loc[0]

Name      Ahmar
Age          23
Salary    23000
Name: 0, dtype: object

In [7]:
df.iloc[0:2]

     Name  Age  Salary
0   Ahmar   23   23000
1  Tayyab   12   45000

In [8]:
 df.loc[1,"Salary"]=6500
df

      Name  Age  Salary
0    Ahmar   23   23000
1   Tayyab   12    6500
2  Nokhaiz   12   55000
3    Awais   13   23000

In [9]:
df[df['Age']>25]
df

      Name  Age  Salary
0    Ahmar   23   23000
1   Tayyab   12    6500
2  Nokhaiz   12   55000
3    Awais   13   23000

In [10]:
df.isnull().sum()

Name      0
Age       0
Salary    0
dtype: int64

In [43]:
df.shape

(4, 3)

In [11]:
df['Age'] =df['Age'].astype(float)

In [12]:
df.drop_duplicates(inplace = True)
df.drop_duplicates(subset=['Name','Salary'],inplace=True)

In [13]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [45]:
df.shape

(4, 3)